sgilbert182/ODrive/Firmware/Board/v3/Odrive.ioc
TIM8.IPParameters=Channel-PWM Generation3 CH3 CH3N,Channel-PWM Generation2 CH2 CH2N,CounterMode,Period,OffStateRunMode,OffStateIDLEMode,DeadTime,OCMode_PWM-PWM Generation1 CH1 CH1N,OCMode_PWM-PWM Generation2 CH2 CH2N,OCMode_PWM-PWM Generation3 CH3 CH3N,Channel-Output Compare4 No Output,TIM_MasterOutputTrigger,Channel-PWM Generation1 CH1 CH1N,RepetitionCounter
Mcu.Pin2=PC15-OSC32_OUT
Mcu.Pin3=PH0-OSC_IN
Mcu.Pin4=PH1-OSC_OUT
PA0-WKUP.GPIOParameters=GPIO_PuPd,GPIO_Label
Mcu.Pin5=PC0
TIM8.Channel-PWM\ Generation1\ CH1\ CH1N=TIM_CHANNEL_1
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_6
ADC1.ExternalTrigInjecConv=ADC_EXTERNALTRIGINJECCONV_T1_TRGO
RCC.HSE_VALUE=8000000
Dma.SPI3_TX.3.PeriphInc=DMA_PINC_DISABLE
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:false
ADC3.InjNumberOfConversion=1
Mcu.IP10=TIM1
Dma.UART4_TX.1.Mode=DMA_NORMAL
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:true\:true
Mcu.IP12=TIM3
Dma.UART4_RX.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
Mcu.IP11=TIM2
Mcu.IP18=USB_DEVICE
VP_SYS_VS_tim14.Signal=SYS_VS_tim14
Mcu.IP17=UART4
Mcu.IP19=USB_OTG_FS
Dma.SPI3_TX.3.Priority=DMA_PRIORITY_MEDIUM
Mcu.IP14=TIM5
Mcu.IP13=TIM4
Mcu.IP16=TIM13
Mcu.IP15=TIM8
Dma.SPI3_RX.4.Mode=DMA_NORMAL
RCC.VCOInputFreq_Value=2000000
PA14.Mode=Serial_Wire
PA0-WKUP.Stacked=true
File.Version=6
PA10.GPIO_Label=M0_CH
ADC3.DataAlign=ADC_DATAALIGN_RIGHT
PB3.GPIOParameters=GPIO_Label
SH.ADCx_IN13.ConfNb=3
PB7.Signal=S_TIM4_CH2
PB8.Locked=true
SH.S_TIM3_CH1.0=TIM3_CH1,Encoder_Interface
SH.ADCx_IN6.ConfNb=2
Dma.RequestsNb=5
PB6.GPIOParameters=GPIO_Label
PA1.Stacked=true
PB0.Locked=true
FREERTOS.configTOTAL_HEAP_SIZE=65536
PC14-OSC32_IN.GPIOParameters=PinState,GPIO_Label
ProjectManager.ProjectName=Odrive
SH.SharedStack_PA1.0=GPIO_Input+0
SH.S_TIM8_CH3.ConfNb=1
USB_DEVICE.APP_RX_DATA_SIZE-CDC_FS=64
SH.SharedStack_PA1.1=UART4_RX,Asynchronous
PH1-OSC_OUT.Mode=HSE-External-Oscillator
PB7.GPIO_Label=M1_ENC_B
TIM8.OCMode_PWM-PWM\ Generation1\ CH1\ CH1N=TIM_OCMODE_PWM2
PA6.Signal=ADCx_IN6
TIM8.Channel-PWM\ Generation3\ CH3\ CH3N=TIM_CHANNEL_3
PA7.Locked=true
PC14-OSC32_IN.PinState=GPIO_PIN_SET
ADC1.SamplingTime-1\#ChannelInjectedConversion=ADC_SAMPLETIME_3CYCLES
NVIC.OTG_FS_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
Dma.UART4_TX.1.MemInc=DMA_MINC_ENABLE
TIM4.IC1Polarity=TIM_ICPOLARITY_RISING
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=GPIO_3
RCC.LSI_VALUE=32000
Dma.UART4_TX.1.PeriphInc=DMA_PINC_DISABLE
USB_OTG_FS.VirtualMode=Device_Only
PA15.Signal=GPIO_Input
TIM8.OCMode_PWM-PWM\ Generation3\ CH3\ CH3N=TIM_OCMODE_PWM2
VP_TIM13_VS_ClockSourceINT.Signal=TIM13_VS_ClockSourceINT
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_FS
ADC2.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_3CYCLES
NVIC.SPI3_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
TIM4.IC1Filter=4
ADC3.ClockPrescaler=ADC_CLOCK_SYNC_PCLK_DIV4
PB5.GPIO_Label=M0_ENC_B
ADC2.NbrOfConversion=1
Dma.Request2=ADC1
Dma.Request1=UART4_TX
Dma.Request4=SPI3_RX
Dma.Request3=SPI3_TX
PC4.Locked=true
NVIC.DMA1_Stream0_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
SPI3.IPParameters=Mode,CalculateBaudRate,BaudRatePrescaler,DataSize,FirstBit,CLKPhase,VirtualType,Direction
PC14-OSC32_IN.GPIO_Label=M1_nCS
PC5.Signal=ADCx_IN15
ADC2.Rank-0\#ChannelRegularConversion=1
TIM8.OCMode_PWM-PWM\ Generation2\ CH2\ CH2N=TIM_OCMODE_PWM2
Dma.Request0=UART4_RX
PC2.GPIO_Label=M1_IC
SH.SharedStack_PA0.1=UART4_TX,Asynchronous
SH.SharedStack_PA0.0=GPIO_EXTI0+0
PC14-OSC32_IN.Locked=true
PB15.Locked=true
PB3.Locked=true
PB4.Signal=S_TIM3_CH1
PA3.Signal=S_TIM5_CH4
ADC1.ExternalTrigInjecConvEdge=ADC_EXTERNALTRIGINJECCONVEDGE_RISING
PC13-ANTI_TAMP.GPIOParameters=PinState,GPIO_Label
PA2.Locked=true
PB3.GPIO_Label=GPIO_8
ADC3.Channel-7\#ChannelRegularConversion=ADC_CHANNEL_12
Dma.SPI3_TX.3.MemInc=DMA_MINC_ENABLE
SH.ADCx_IN13.2=ADC3_IN13,IN13
ADC2.ClockPrescaler=ADC_CLOCK_SYNC_PCLK_DIV4
SH.ADCx_IN13.1=ADC2_IN13,IN13
ADC3.DiscontinuousConvMode=DISABLE
TIM2.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
SH.ADCx_IN13.0=ADC1_IN13,IN13
ADC2.ExternalTrigInjecConv=ADC_EXTERNALTRIGINJECCONV_T1_TRGO
TIM1.OffStateIDLEMode=TIM_OSSI_ENABLE
PA7.Mode=PWM Generation1 CH1 CH1N
TIM2.CounterMode=TIM_COUNTERMODE_CENTERALIGNED3
UART4.IPParameters=VirtualMode
PC9.GPIO_Label=M0_ENC_Z
ProjectManager.NoMain=false
USB_DEVICE.VirtualModeFS=Cdc_FS
ADC3.Channel-8\#ChannelInjectedConversion=ADC_CHANNEL_11
PC11.Signal=SPI3_MISO
Dma.ADC1.2.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
PC8.Signal=S_TIM8_CH3
PC4.Signal=GPIO_Input
PC10.Mode=Full_Duplex_Master
ADC1.DiscontinuousConvMode=DISABLE
ProjectManager.DefaultFWLocation=true
PB12.Locked=true
ProjectManager.DeletePrevious=true
PB10.Locked=true
USB_DEVICE.IPParameters=VirtualMode-CDC_FS,VirtualModeFS,CLASS_NAME_FS,MANUFACTURER_STRING-CDC_FS,PRODUCT_STRING_CDC_FS,VID-CDC_FS,PID_CDC_FS,SERIALNUMBER_STRING_CDC_FS,APP_RX_DATA_SIZE-CDC_FS,APP_TX_DATA_SIZE-CDC_FS
RCC.FamilyName=M
TIM5.ICPolarity_CH4=TIM_INPUTCHANNELPOLARITY_BOTHEDGE
TIM5.ICPolarity_CH3=TIM_INPUTCHANNELPOLARITY_BOTHEDGE
PA0-WKUP.Locked=true
FREERTOS.INCLUDE_uxTaskGetStackHighWaterMark=1
SH.ADCx_IN12.2=ADC3_IN12,IN12
PC8.GPIO_Label=M1_CH
PA13.Signal=SYS_JTMS-SWDIO
FREERTOS.configUSE_IDLE_HOOK=1
VP_FREERTOS_VS_CMSIS_V1.Signal=FREERTOS_VS_CMSIS_V1
SH.ADCx_IN12.1=ADC2_IN12,IN12
SH.SharedStack_PA1.ConfNb=2
SH.ADCx_IN12.0=ADC1_IN12,IN12
SH.S_TIM1_CH1.0=TIM1_CH1,PWM Generation1 CH1 CH1N
CAN1.BS2=CAN_BS2_5TQ
Dma.UART4_RX.0.Direction=DMA_PERIPH_TO_MEMORY
CAN1.BS1=CAN_BS1_6TQ
ProjectManager.TargetToolchain=Makefile
PB10.GPIO_Label=AUX_L
NVIC.DMA1_Stream5_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
PB7.GPIOParameters=GPIO_Label
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
PC5.GPIOParameters=GPIO_Label
PB2.GPIOParameters=GPIO_Label
RCC.LSE_VALUE=32768
PC15-OSC32_OUT.Signal=GPIO_Input
PA1.Signal=SharedStack_PA1
PB1.Locked=true
SH.S_TIM1_CH2.ConfNb=1
TIM3.IC2Polarity=TIM_ICPOLARITY_RISING
TIM4.IC2Polarity=TIM_ICPOLARITY_RISING
RCC.VCOI2SOutputFreq_Value=384000000
SH.S_TIM3_CH2.0=TIM3_CH2,Encoder_Interface
ADC2.SamplingTime-1\#ChannelInjectedConversion=ADC_SAMPLETIME_3CYCLES
PB0.Mode=PWM Generation2 CH2 CH2N
TIM8.DeadTime=TIM_1_8_DEADTIME_CLOCKS
board=Odrive
SPI3.CLKPhase=SPI_PHASE_2EDGE
RCC.VCOOutputFreq_Value=336000000
PC13-ANTI_TAMP.Locked=true
TIM1.OCNPolarity_1=TIM_OCNPOLARITY_HIGH
PB15.Mode=PWM Generation3 CH3 CH3N
VP_TIM1_VS_no_output4.Mode=Output Compare4 No Output
ADC1.EnableAnalogWatchDog=false
Dma.UART4_RX.0.Priority=DMA_PRIORITY_LOW
ADC2.DataAlign=ADC_DATAALIGN_RIGHT
RCC.APB2Freq_Value=84000000
SH.ADCx_IN11.2=ADC3_IN11,IN11
SPI3.CalculateBaudRate=2.625 MBits/s
TIM1.OCNPolarity_3=TIM_OCNPOLARITY_HIGH
SH.ADCx_IN11.1=ADC2_IN11,IN11
TIM1.OCNPolarity_2=TIM_OCNPOLARITY_HIGH
SH.ADCx_IN11.0=ADC1_IN11,IN11
MxCube.Version=5.6.0
SH.S_TIM1_CH2.0=TIM1_CH2,PWM Generation2 CH2 CH2N
SH.S_TIM2_CH3.0=TIM2_CH3,PWM Generation3 CH3
SH.ADCx_IN10.ConfNb=3
SPI3.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_16
PC1.GPIO_Label=M0_IC
PA10.GPIOParameters=GPIO_Label
Dma.SPI3_TX.3.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
TIM2.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
PH1-OSC_OUT.Signal=RCC_OSC_OUT
Dma.UART4_RX.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
SH.ADCx_IN15.ConfNb=2
CAN1.TimeSeg1=CAN_BS1_6TQ
SH.S_TIM5_CH4.0=TIM5_CH4,Input_Capture4_from_TI4
CAN1.TimeSeg2=CAN_BS2_5TQ
PA4.GPIOParameters=GPIO_Label
TIM1.OffStateRunMode=TIM_OSSR_ENABLE
PB15.GPIOParameters=GPIO_Label
ADC1.NbrOfConversion=1
RCC.IPParameters=48MHZClocksFreq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimCLKDivider,APB2TimFreq_Value,CortexFreq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2SClocksFreq_Value,LSE_VALUE,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLM,PLLN,PLLQ,PLLQCLKFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VcooutputI2S
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F405RGTx
PA2.Signal=S_TIM5_CH3
PB2.Locked=true
Mcu.IP8=SPI3
Mcu.IP9=SYS
Mcu.IP6=NVIC
Mcu.IP7=RCC
ProjectManager.CoupleFile=true
RCC.48MHZClocksFreq_Value=48000000
PB3.Signal=GPIO_Input
RCC.SYSCLKFreq_VALUE=168000000
Dma.ADC1.2.Priority=DMA_PRIORITY_LOW
PA7.GPIO_Label=M1_AL
PA1.Locked=true
PA12.Mode=Device_Only
Dma.ADC1.2.PeriphInc=DMA_PINC_DISABLE
KeepUserPlacement=true
PC5.GPIO_Label=M0_TEMP
TIM3.IC1Polarity=TIM_ICPOLARITY_RISING
Dma.SPI3_RX.4.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
SH.ADCx_IN10.2=ADC3_IN10,IN10
SH.ADCx_IN10.1=ADC2_IN10,IN10
PA14.Signal=SYS_JTCK-SWCLK
SH.ADCx_IN10.0=ADC1_IN10,IN10
PB2.GPIO_Label=GPIO_6
Dma.UART4_TX.1.Priority=DMA_PRIORITY_LOW
SH.S_TIM2_CH4.0=TIM2_CH4,PWM Generation4 CH4
PC6.GPIOParameters=GPIO_Label
SH.S_TIM1_CH3.0=TIM1_CH3,PWM Generation3 CH3 CH3N
TIM1.Channel-Output\ Compare4\ No\ Output=TIM_CHANNEL_4
RCC.HSI_VALUE=16000000
ADC2.ExternalTrigConvEdge=ADC_EXTERNALTRIGCONVEDGE_RISING
RCC.PLLQ=7
ADC1.NbrOfConversionFlag=1
RCC.PLLM=4
RCC.PLLN=168
PB8.Signal=SharedStack_PB8
PC8.Locked=true
TIM5.Period=0xFFFFFFFF
PC9.Signal=GPIO_Input
Dma.SPI3_RX.4.Priority=DMA_PRIORITY_MEDIUM
ADC1.DataAlign=ADC_DATAALIGN_RIGHT
RCC.APB1Freq_Value=42000000
ADC3.NbrOfConversionFlag=1
ADC1.ClockPrescaler=ADC_CLOCK_SYNC_PCLK_DIV4
ADC2.InjNumberOfConversion=1
PB11.Locked=true
ProjectManager.DeviceId=STM32F405RGTx
SH.S_TIM8_CH2.ConfNb=1
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=1
TIM5.Channel-Input_Capture3_from_TI3=TIM_CHANNEL_3
PA3.GPIO_Label=GPIO_4
PB1.GPIOParameters=GPIO_Label
PA7.Signal=TIM8_CH1N
PA6.Locked=true
